RiccardoZiani/3-Vie-Lavatrice/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT_CLKOE_0b0 0x00u /*!<@brief Bus Clock Output Enable: Bus clock output is disabled on PTH2. */

/*! @name PORTD2 (number 46), J9[9]
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Pulsante_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Pulsante_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Pulsante_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTE7 (number 5), D4[3]/LEDRGB_BLUE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTE7_BLUE_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_PTE7_BLUE_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTE7_BLUE_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_PTE7_BLUE_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTE7_BLUE_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTE7_BLUE_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTE7_BLUE_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTH2 (number 6), D4[4]/LEDRGB_GREEN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTH2_GREEN_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_PTH2_GREEN_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTH2_GREEN_GPIO_PORT kGPIO_PORTH    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_PTH2_GREEN_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTH2_GREEN_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTH2_GREEN_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTH2_GREEN_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTH1 (number 14), D4[1]/LEDRGB_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_PTH1_RED_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_PTH1_RED_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_PTH1_RED_GPIO_PORT kGPIO_PORTH    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_PTH1_RED_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_PTH1_RED_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_PTH1_RED_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_PTH1_RED_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PORTE3 (number 53), J9[7]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Button1_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Button1_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Button1_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_Button1_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Button1_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Button1_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Button1_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTE2 (number 54), J9[5]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Button2_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Button2_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Button2_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_Button2_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Button2_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Button2_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Button2_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORTF1 (number 42), J9[11]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led_1_Ora_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led_1_Ora_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led_1_Ora_GPIO_PORT kGPIO_PORTF    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_Led_1_Ora_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led_1_Ora_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led_1_Ora_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led_1_Ora_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTF0 (number 43), J9[13]
  @{ */

