RiccardoZiani/3-Vie-Lavatrice/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led_2_Ora_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led_2_Ora_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led_2_Ora_GPIO_PORT kGPIO_PORTF    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_Led_2_Ora_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led_2_Ora_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led_2_Ora_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led_2_Ora_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTG3 (number 55), J9[15]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led_3_Ora_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led_3_Ora_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led_3_Ora_GPIO_PORT kGPIO_PORTG    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_Led_3_Ora_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led_3_Ora_PORT PORTG               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led_3_Ora_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led_3_Ora_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTE1 (number 59), J9[3]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led_Fredda_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led_Fredda_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led_Fredda_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_Led_Fredda_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led_Fredda_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led_Fredda_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led_Fredda_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORTE0 (number 60), J9[1]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Led_Calda_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Led_Calda_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Led_Calda_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_Led_Calda_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Led_Calda_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Led_Calda_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Led_Calda_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORTF7 (number 27), J2[9]/J10[2]/PTF7_A0_ANA0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Start_Fredda_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Start_Fredda_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Start_Fredda_GPIO_PORT kGPIO_PORTF    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITPINS_Start_Fredda_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Start_Fredda_PORT PORTF               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Start_Fredda_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Start_Fredda_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORTC0 (number 26), J10[4]
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_Start_Calda_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITPINS_Start_Calda_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_Start_Calda_GPIO_PORT kGPIO_PORTC    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITPINS_Start_Calda_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITPINS_Start_Calda_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_Start_Calda_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_Start_Calda_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define SOPT_CLKOE_0b0 0x00u /*!<@brief Bus Clock Output Enable: Bus clock output is disabled on PTH2. */

/*! @name PORTE7 (number 5), D4[3]/LEDRGB_BLUE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_PTE7_BLUE_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_PTE7_BLUE_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_PTE7_BLUE_GPIO_PORT kGPIO_PORTE    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITLEDSPINS_PTE7_BLUE_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_PTE7_BLUE_PORT PORTE               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_PTE7_BLUE_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_PTE7_BLUE_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTH2 (number 6), D4[4]/LEDRGB_GREEN
  @{ */

