RiccardoZiani/3-Vie-Lavatrice/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_PTH2_GREEN_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_PTH2_GREEN_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_PTH2_GREEN_GPIO_PORT kGPIO_PORTH    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITLEDSPINS_PTH2_GREEN_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_PTH2_GREEN_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_PTH2_GREEN_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_PTH2_GREEN_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTH1 (number 14), D4[1]/LEDRGB_RED
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_PTH1_RED_FGPIO FGPIOB             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_PTH1_RED_GPIO GPIOB               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_PTH1_RED_GPIO_PORT kGPIO_PORTH    /*!<@brief PORTB GPIO port: PORTB */
#define BOARD_INITLEDSPINS_PTH1_RED_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITLEDSPINS_PTH1_RED_PORT PORTH               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_PTH1_RED_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_PTH1_RED_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

/*! @name PORTD6 (number 23), J1[7]/PTD6_TSI/PTD6_RXD2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITTOUCHPINS_PTD6_TSI_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITTOUCHPINS_PTD6_TSI_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITTOUCHPINS_PTD6_TSI_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITTOUCHPINS_PTD6_TSI_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITTOUCHPINS_PTD6_TSI_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITTOUCHPINS_PTD6_TSI_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITTOUCHPINS_PTD6_TSI_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PORTD7 (number 22), J1[5]/PTD7_TSI/PTD7_TXD2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITTOUCHPINS_PTD7_TSI_FGPIO FGPIOA             /*!<@brief FGPIO peripheral base pointer */
#define BOARD_INITTOUCHPINS_PTD7_TSI_GPIO GPIOA               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITTOUCHPINS_PTD7_TSI_GPIO_PORT kGPIO_PORTD    /*!<@brief PORTA GPIO port: PORTA */
#define BOARD_INITTOUCHPINS_PTD7_TSI_GPIO_PIN_MASK (1U << 31U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITTOUCHPINS_PTD7_TSI_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITTOUCHPINS_PTD7_TSI_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITTOUCHPINS_PTD7_TSI_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitTOUCHPins(void);

/*! @name PORTC6 (number 52), J1[3]/PTC6_RXD1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_RX_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*! @name PORTC7 (number 51), J1[1]/PTC7_TXD1
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITDEBUG_UARTPINS_DEBUG_UART_TX_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORTA3 (number 47), J2[20]/U1[4]/PTA3_ACCEL_SCL/PTA3_D15
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCELPINS_ACCEL_SCL_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_SCL_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCEL_SCL_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTA2 (number 48), J2[18]/U1[6]/PTA2_ACCEL_SDA/PTA2_D14
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITACCELPINS_ACCEL_SDA_PORT PORTA               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCEL_SDA_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITACCELPINS_ACCEL_SDA_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORTD4 (number 44), U1[11]/PTD4_ACCEL_INT1
  @{ */

